console.log(
    `Требования к вёрстке \n
    1. Вёрстка соответствует макету. Ширина экрана 768px +26 \n
    2. Ни на одном из разрешений до 640px включительно не появляется горизонтальная полоса прокрутки. Весь контент страницы при этом сохраняется: не обрезается и не удаляется +12 \n
    3. На ширине экрана 768рх реализовано адаптивное меню +12:
        - Версия Tablet, отступ иконки юзера от правого края - 105px. Меню прижато к правому краю. Иконка юзера не прыгает (не меняет позиции при открытии меню), независимо от величины отступа: +2 \n
        - при нажатии на бургер-иконку плавно появляется адаптивное меню +4 \n
        - при нажатии на крестик, или на область вне меню, адаптивное меню плавно скрывается, уезжая за экран +2 (не реализовано закрытие меню при нажатии на область вне меню -1) \n
        - ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям при нажатии, а само адаптивное меню при этом плавно скрывается +2 (меню не закрывается при нажатии на ссылки -1) \n
        - размеры открытого бургер-меню соответствуют макету +2`
);